{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Lissandra",
        "Name": "Lissandra",
        "ResourcePath": "DATA/Characters/Lissandra/Lissandra.inibin"
    },
    "Values": {
        "Data": {
            "AbilityPowerIncPerLevel": 0,
            "AcquisitionRange": 600,
            "Armor": 20.216,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3.7,
            "AttackDelayCastOffsetPercent": -0.1125,
            "AttackDelayOffsetPercent": 0,
            "AttackRange": 550,
            "AttackSpeedPerLevel": 1.36,
            "BaseAbilityPower": 0,
            "BaseAttack_Probability": 0.5,
            "BaseCritChance": 0,
            "BaseDamage": 50.536,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 506.12,
            "BaseMP": 304.0,
            "BaseStaticHPRegen": 1.3848,
            "BaseStaticMPRegen": 1.1344,
            "championId": 127,
            "ChasingAttackRangePercent": 0.8,
            "CritAttack": "LissandraCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": 0,
            "CritAttack_AttackDelayOffsetPercent": -0.1125,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 2.7,
            "Description": "the Ice Witch",
            "ExtraAttack1": "LissandraBasicAttack2",
            "ExtraAttack1_Probability": 0.5,
            "ExtraSpell1": "LissandraWRootMissile",
            "ExtraSpell2": "LissandraQMissile",
            "ExtraSpell3": "LissandraEMissile",
            "ExtraSpell4": "LissandraREnemy",
            "ExtraSpell5": "LissandraQShards",
            "HPPerLevel": 84,
            "HPRegenPerLevel": 0.11,
            "IsMelee": false,
            "LevelDodge": 0,
            "Lore1": "Lissandra's magic twists the pure power of ice into something dark and terrible. With the force of her black ice, she does more than freeze - she impales and crushes those who oppose her. To the terrified denizens of the north, she is known only as ''The Ice Witch.'' The truth is much more sinister: Lissandra is a corruptor of nature who plots to unleash an ice age on the world.<br><br>Centuries ago, Lissandra betrayed her tribe to evil creatures, known as the Frozen Watchers, in return for power. That was the last day that warm blood ran through her veins. With her corrupted tribesmen and the strength of the Watchers, she swept across the land like a terrible blizzard. As her empire spread, the world grew colder and ice choked the land. When the Watchers were defeated by ancient heroes, Lissandra did not lose faith and swore to prepare the world for their return.<br><br>Lissandra worked to purge all knowledge of the Watchers from the world. Using magic to take human form, she masqueraded as numerous seers and elders. Over the course of generations, she rewrote the stories of the Freljord, and so the history of its people changed. Today the fragmented retellings of the Watchers are seen as children's tales. But this deception wasn't enough - Lissandra also needed an army.<br><br>She set her sights on the noble Frostguard tribe. Lissandra knew corrupting the Frostguard would take centuries, and so she launched her greatest deception. She murdered and stole the identity of the Frostguard leader. Then she slowly began to warp the tribe's proud traditions. When her human form grew old, she faked her own death and then murdered her successor to steal her identity. With each generation, the Frostguard grew more insular, cruel and twisted. Today, the world still sees them as a noble and peaceful tribe that guards against evil creatures like the Ice Witch. In truth, they now serve the witch and long for the glorious return of the Watchers.<br><br>Lissandra knows that on that day nations will fall and the world will be reborn in ice.<br><br>''Close your eyes and let the cold take you.'' <br>-- Lissandra",
            "MaxLevels": "5 5 5 3",
            "MoveSpeed": 325,
            "MPPerLevel": 50,
            "MPRegenPerLevel": 0.08,
            "Name": "Lissandra",
            "Passive1Icon": "Lissandra_Passive.dds",
            "Passive1LuaName": "LissandraPassive",
            "Passive1Name": "Iceborn",
            "PassLev1Desc1": "Every 18 seconds Lissandra's next ability costs no Mana. This cooldown is reduced by 1 second whenever Lissandra impairs an enemy's movement with an ability (does not apply to movement-impairing effects from items).",
            "PathfindingCollisionRadius": 35,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 250,
            "SelectionRadius": 88.8889,
            "Spell1": "LissandraQ",
            "Spell2": "LissandraW",
            "Spell3": "LissandraE",
            "Spell4": "LissandraR",
            "SpellBlock": 30.0,
            "SpellBlockPerLevel": 0,
            "SpellSupLevels1": "1 3 5 7 9 11",
            "SpellSupLevels2": "1 3 5 7 9 11",
            "SpellSupLevels3": "1 3 5 7 9 11",
            "SpellSupLevels4": "6 11 16",
            "Tips1": "<ul><li>You can instantly use your ultimate on yourself by pressing the self cast key and the ultimate key at once (alt+R by default).<li>Casting Glacial Path and then running in the opposite direction will leave your enemies uncertain which way you will actually go.<li>Lissandra's abilities are shorter range than those of many mages. As a result, buying items that offer both ability power and defense, like Zhonya's Hourglass and Abyssal Scepter, can be a great choice to help her both survive and deal damage.</ul>",
            "Tips2": "<ul>The best way to stop Lissandra from moving using her Glacial Path is to immobilize her before she reactivates it.<li>Lissandra's Ring of Frost has a long cooldown at early ranks; engage her while it's on cooldown.<li>Lissandra's Ice Shard only slows the first unit it hits. Approach Lissandra from behind your team's minions to avoid being slowed.</ul>",
            "UnitTags": "Champion"
        },
        "DefaultAnimations": {
            "Animation1": "Run_ICE",
            "NumberOfAnimations": 1
        },
        "HealthBar": {
            "ParallaxOffset": 0,
            "XOffset": 0,
            "YOffset": 0
        },
        "IdleParticles": {
            "NumberOfParticles": 1,
            "Particle1": "Lissandra_Base_Idle.troy BUFFBONE_GLB_GROUND_LOC"
        },
        "Info": {
            "IconCircle": "Lissandra_Circle.dds",
            "IconSquare": "Lissandra_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 8,
            "105898023": 6,
            "113008000": 14,
            "121269505": 15,
            "129531010": 0,
            "137792515": 16,
            "2179197562": false,
            "2441097661": "MAGE",
            "2786390348": 5,
            "4094915649": 1056,
            "4146314945": "mage",
            "510504319": 0,
            "767627316": 2,
            "923756730": false
        }
    }
}