{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Yasuo",
        "Name": "Yasuo",
        "ResourcePath": "DATA/Characters/Yasuo/Yasuo.inibin"
    },
    "Values": {
        "Data": {
            "AcquisitionRange": 400,
            "Armor": 24.712,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3.4,
            "AttackDelayCastOffsetPercent": -0.08,
            "AttackDelayCastOffsetPercentAttackSpeedRatio": 1,
            "AttackDelayOffsetPercent": -0.05,
            "AttackRange": 175,
            "AttackSpeedPerLevel": 3.2,
            "BaseAttack_Probability": 1,
            "BaseCritChance": 0,
            "BaseDamage": 55.376,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 517.76,
            "BaseMP": 60.0,
            "BaseStaticHPRegen": 1.3024,
            "BaseStaticMPRegen": 0,
            "championId": 157,
            "ChasingAttackRangePercent": 0.5,
            "Classification": "Strong",
            "CritAttack": "YasuoCritAttack",
            "CritAttack_AttackDelayCastOffsetPercentAttackSpeedRatio": 1,
            "CritAttack_AttackDelayOffsetPercent": -0.05,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3.2,
            "DelayCastOffsetPercent": -0.75,
            "DelayTotalTimePercent": -0.1,
            "Description": "the Unforgiven",
            "DrawParLikeHealth": true,
            "ExtraAttack1": "YasuoBasicAttack2",
            "ExtraAttack1_Probability": 0,
            "ExtraAttack2": "YasuoBasicAttack3",
            "ExtraAttack2_Probability": 0,
            "ExtraAttack3": "YasuoBasicAttack4",
            "ExtraAttack3_Probability": 0,
            "ExtraAttack4_Probability": 0,
            "ExtraAttack5_Probability": 0,
            "ExtraAttack6_Probability": 0,
            "ExtraAttack7_Probability": 0,
            "ExtraAttack8_Probability": 0,
            "ExtraCritAttack1": "YasuoCritAttack2",
            "ExtraCritAttack2": "YasuoCritAttack3",
            "ExtraCritAttack3": "YasuoCritAttack4",
            "HPPerLevel": 82,
            "HPRegenPerLevel": 0.18,
            "IsMelee": true,
            "LevelDodge": 0,
            "Lore1": "Yasuo is a man of resolve, an agile swordsman who wields the wind itself to cut down his foes. This once-proud warrior has been disgraced by a false accusation and forced into a desperate fight for survival. With the world turned against him, he will do everything in his power to bring the guilty to justice and restore his honor.<br><br>Formerly a brilliant pupil at a renowned Ionian sword school, Yasuo was the only student in a generation to master the legendary wind technique. Many believed he was destined to become a great hero. However, his fate was changed forever when Noxus invaded. Yasuo was charged with guarding an Ionian Elder, but, foolishly believing his blade alone could make the difference, he left his post to join the fray. By the time he returned, the Elder had been slain.<br><br>Disgraced, Yasuo willingly turned himself in, prepared to pay for his failure with his life. He was shocked, however, to find himself accused not just of dereliction, but of the murder itself. Though confused and racked with guilt, he knew the assassin would go unpunished if he did not act. Yasuo raised his sword against the school and fought his way free, knowing his treason would turn all of Ionia against him. Left truly alone for the first time in his life, he set out to find the Elder's real killer.<br><br>Yasuo spent the next several years wandering the land, seeking any clue that might lead him to the murderer. All the while, he was relentlessly hunted by his former allies, continually forced to fight or die. His mission drove him ever forward, until he was tracked down by the one foe he dreaded most - his own brother, Yone.<br><br>Bound by a common code of honor, the two warriors bowed and drew their swords. Silently they circled one another under the moonlight. When they finally charged forward, Yone was no match for Yasuo; with a single flash of steel he cut his brother down. Yasuo dropped his weapon and rushed to Yone's side.<br><br>Overcome with emotion, he demanded to know how his own kin could think him guilty. Yone spoke: ''The Elder was killed by a wind technique. Who else could it be?'' Understanding swept over Yasuo as he suddenly realized why he had been accused. He professed his innocence once more and begged his brother's forgiveness. Tears streamed down Yasuo's face as his brother passed in his arms.<br><br>Yasuo buried Yone under the rising sun, but could take no time to mourn. Others would be after him before long. His brother's revelation had given Yasuo newfound purpose; he now had the clue that would lead to the true killer. Swearing an oath, he gathered his belongings and, with one last look at Yone's grave, set out with the wind at his back.<br><br>''The story of a sword is inked in blood.''<br>-- Yasuo",
            "MoveSpeed": 340,
            "MPPerLevel": 0,
            "MPRegenPerLevel": 0,
            "Name": "Yasuo",
            "PARColor": "85 85 85",
            "PARFadeColor": "0 0 0",
            "PARIncrements": 100,
            "PARMaxSegments": 10,
            "PARType": "Wind",
            "Passive1Icon": "Yasuo_Passive.dds",
            "Passive1LuaName": "YasuoPassive",
            "Passive1Name": "Way of the Wanderer",
            "PassLev1Desc1": "Yasuo's Critical Strike Chance is doubled. Additionally, Yasuo builds toward a shield whenever he is moving. The shield triggers when he takes damage from a champion or monster.",
            "PathfindingCollisionRadius": 32,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 180,
            "SelectionRadius": 75,
            "Spell1": "YasuoQW",
            "Spell2": "YasuoWMovingWall",
            "Spell3": "YasuoDashWrapper",
            "Spell4": "YasuoRKnockUpComboW",
            "SpellBlock": 30.0,
            "SpellBlockPerLevel": 0,
            "Tips1": "<ul><li>Dash through a minion to have Sweeping Blade available to chase your opponent should they flee; Dash directly to your opponent to preserve a minion as your escape route.<li>At level 18, Yasuo's Steel Tempest reaches its Attack Speed cap with 55% Attack Speed from items.<li>Last Breath can be cast on any target that is knocked Airborne, even by one of your allies.</ul>",
            "Tips2": "<ul><li>Steel Tempest is very narrow. Dodge laterally if possible. <li>When Yasuo lands two Steel Tempests in a row, his next will fire a tornado. Watch and listen for the associated sound to prepare to dodge.<li>Yasuo is at his weakest just after he has launched a whirlwind. Engage at that point.<li>Yasuo's shield from Resolve lasts only 2 seconds. Dealing damage to him will trigger it. Wait it out, then engage.</ul>",
            "UnitTags": "Champion",
            "WeaponMaterial": "YasuoBasicAttack",
            "WeaponMaterial1": "YasuoBasicAttack",
            "WeaponMaterial2": "YasuoBasicAttack"
        },
        "DefaultAnimations": {
            "Animation1": "Mask",
            "Animation2": "BottleFix_Skin01",
            "NumberOfAnimations": 2
        },
        "HealthBar": {
            "ParallaxOffset": 0,
            "XOffset": 0,
            "YOffset": -0.6
        },
        "Info": {
            "IconCircle": "Yasuo_Circle.dds",
            "IconSquare": "Yasuo_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 4,
            "105898023": 10,
            "2179197562": false,
            "2500095475": "assassin",
            "2786390348": 4,
            "386495002": 2,
            "3983263047": 0,
            "4094915649": 1054,
            "4146314945": "fighter",
            "510504319": 0,
            "767627316": 8,
            "847936627": -0.08,
            "923756730": false
        }
    }
}