{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Olaf",
        "Name": "Olaf",
        "ResourcePath": "DATA/Characters/Olaf/Olaf.inibin"
    },
    "Values": {
        "Data": {
            "AcquisitionRange": 400,
            "Armor": 26.04,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3,
            "AttackDelayCastOffsetPercent": -0.065625,
            "AttackDelayOffsetPercent": -0.1,
            "AttackRange": 125,
            "AttackSpeedPerLevel": 2.7,
            "BaseAttack_Probability": 0.5,
            "BaseCritChance": 0,
            "BaseDamage": 59.98,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 597.24,
            "BaseMP": 265.6,
            "BaseStaticHPRegen": 1.7024,
            "BaseStaticMPRegen": 1.4932,
            "championId": 2,
            "ChasingAttackRangePercent": 0.5,
            "Classification": "Strong",
            "CritAttack": "OlafCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": -0.065625,
            "CritAttack_AttackDelayOffsetPercent": -0.1,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3.5,
            "Description": "the Berserker",
            "ExtraAttack1": "OlafBasicAttack2",
            "ExtraAttack1_Probability": 0.5,
            "ExtraAttack2": "OlafBasicAttack3",
            "ExtraAttack2_Probability": 0,
            "ExtraSpell1": "OlafAxeThrow",
            "HPPerLevel": 93,
            "HPRegenPerLevel": 0.18,
            "IsMelee": true,
            "LevelDodge": 0,
            "Lore1": "Most men would say that death is a thing to be feared; none of those men would be Olaf. The Berserker lives only for the roar of a battle cry and the clash of steel. Spurred on by his hunger for glory and the looming curse of a forgettable death, Olaf throws himself into every fight with reckless abandon. Surrendering to the bloodlust deep within his being, Olaf is only truly alive when grappling with the jaws of death.<br><br>The coastal peninsula of Lokfar is among the most brutal places in the Freljord. There, rage is the only fire to warm frozen bones, blood is the only liquid that flows freely, and there is no worse fate than to grow old, frail, and forgotten. Olaf was a warrior of Lokfar with no shortage of glories and no hesitation to share them. While boasting one evening with his clansmen over the burning embers of a razed village, one of the elder warriors grew tired of Olaf's bluster. The old fighter goaded Olaf to read the omens and see if Olaf's fortunes matched his gloating. Emboldened by the challenge, Olaf mocked the aged raider's envy and tossed the knuckle bones of a long-dead beast to predict the heights of glory he'd achieve in death. All mirth left the gathering as the clansmen read the portents: the bones spoke of a long life and a quiet passing.<br><br>Infuriated, Olaf stormed into the night determined to prove the prediction false by finding and slaughtering Lokfar's feared frost serpent. The monster had consumed thousands, man and ship alike, in its long lifetime and to die in battle with it would be a fitting end for any warrior. As Olaf hurled himself into the blackness of its maw, he fell deeper into the blackness of his mind. When the shock of freezing water roused him from the dark, there was only the butchered carcass of the beast afloat beside him. Thwarted but not defeated, Olaf set out to hunt down every legendary creature with claws and fangs, hoping that the next battle would be his last. Each time he charged headlong toward his coveted death, only to be spared by the frenzy that washed over him while on its brink.<br><br>Olaf concluded that no mere beast could grant him a warrior's death. His solution was to take on the most fearsome tribe in the Freljord: the Winter's Claw. Sejuani appeared amused by Olaf's challenge to her warband, but his audacity would earn him no mercy. She ordered the charge and sent scores of her warriors to overwhelm Olaf. One by one, they fell until he lost himself in the bloodlust once again, effortlessly cutting a path to the leader of the Winter's Claw. The clash between Olaf and Sejuani rocked the glaciers with its force, and though he seemed unstoppable, Sejuani battled the berserker to a standstill. As they stood deadlocked, Sejuani's glare penetrated Olaf's berserker haze in a way no weapon ever could. His frenzy abated long enough for her to make him an offer: Sejuani swore that she would find Olaf his glorious death if he would lend his axe to her campaign of conquest. In that moment, Olaf vowed he would carve his legacy into the Freljord itself.<br><br>''When you meet your ancestors, tell them Olaf sent you.'' <br>-- Olaf",
            "MoveSpeed": 350,
            "MPPerLevel": 45,
            "MPRegenPerLevel": 0.115,
            "Name": "Olaf",
            "Passive1Icon": "Olaf_Passive.dds",
            "Passive1Level1": 1,
            "Passive1Level2": 4,
            "Passive1Level3": 7,
            "Passive1LuaName": "OlafBerzerkerRage",
            "Passive1Name": "Berserker Rage",
            "PassLev1Desc1": "For each 1% of Health missing, Olaf's Attack Speed is increased by 1%.",
            "PathfindingCollisionRadius": 35,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 191.6667,
            "SelectionRadius": 111.1111,
            "Spell1": "OlafAxeThrowCast",
            "Spell2": "OlafFrenziedStrikes",
            "Spell3": "OlafRecklessStrike",
            "Spell4": "OlafRagnarok",
            "SpellBlock": 32.1,
            "SpellBlockPerLevel": 1.25,
            "Tips1": "<ul><li>Olaf can combine Berserker Rage, Vicious Strikes, and Ragnarok at low life to become deceptively strong.<li>The bonus healing granted by Vicious Strikes amplifies your Life Steal from all sources as well as heals from allies.</ul>",
            "Tips2": "<ul><li>Olaf becomes more dangerous the lower life he is. Save your disables to finish him off.<li>Preventing Olaf from reaching his axe will minimize the amount of harassment he can cause in the laning phase.<li>Olaf has reduced defenses from damage during Ragnarok, despite being immune to disables. If you can't escape from Olaf during Ragnarok, try focusing your damage on him with your teammates.</ul>",
            "UnitTags": "Champion",
            "WeaponMaterial": "OlafBasicAttack"
        },
        "HealthBar": {
            "ParallaxOffset": 0,
            "XOffset": 0,
            "YOffset": -0.6
        },
        "Info": {
            "IconCircle": "Olaf_Circle.dds",
            "IconSquare": "Olaf_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 3,
            "105898023": 3,
            "11266465": "Undying Rage",
            "113008000": 14,
            "121269505": 0,
            "129531010": 0,
            "137792515": 0,
            "1639648700": "Tryndamere slices toward target location, dealing damage to enemies in his path.",
            "1662499919": "OlafCritAttack2",
            "1692812302": 0,
            "2500095475": "tank",
            "2749401147": 1,
            "2779212989": "Tryndamere's lust for battle becomes so strong that he is unable to die, no matter how wounded he becomes.",
            "2786390348": 5,
            "3646501220": "Bloodlust",
            "3655487418": "Tryndamere thrives on the thrills of combat.  Whenever Tryndamere kills a unit or critically strikes, he temporarily gains increased damage and critical damage, and he can consume his Bloodlust to restore health.",
            "386495002": 2,
            "3866412067": "Mocking Shout",
            "3983263047": 0,
            "4086322914": "Slash",
            "4094915649": 1055,
            "4146314945": "fighter",
            "500084411": "Tryndamere issues a brave call toward his cowardly enemies.  Enemies deal reduced damage for a few seconds, and enemies turned away from Tryndamere are mocked mercilessly and move slowly like the chicken they are.",
            "510504319": 0,
            "767627316": 9
        }
    }
}