{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Sejuani",
        "Name": "Sejuani",
        "ResourcePath": "DATA/Characters/Sejuani/Sejuani.inibin"
    },
    "Values": {
        "Data": {
            "Armor": 29.54,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3,
            "AttackDelayCastOffsetPercent": -0.05,
            "AttackDelayOffsetPercent": -0.0672,
            "AttackRange": 125,
            "AttackSpeedPerLevel": 1.44,
            "BaseAttack_Probability": 1,
            "BaseCritChance": 0,
            "BaseDamage": 57.544,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 599.6,
            "BaseMP": 287.2,
            "BaseStaticHPRegen": 1.7356,
            "BaseStaticMPRegen": 1.4412,
            "championId": 113,
            "ChasingAttackRangePercent": 0.8,
            "CritAttack": "SejuaniCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": -0.05,
            "CritAttack_AttackDelayOffsetPercent": -0.0672,
            "CritAttack_Probability": 1,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3.3,
            "Description": "the Winter's Wrath",
            "ExtraAttack1": "SejuaniBasicAttack2",
            "ExtraAttack1_Probability": 0,
            "ExtraAttack2": "SejuaniBasicAttack3",
            "ExtraAttack2_Probability": 0,
            "ExtraAttack3": "SejuaniBasicAttackW",
            "ExtraAttack3_Probability": 0,
            "ExtraSpell1": "SejuaniGlacialPrisonDetonate",
            "ExtraSpell2": "SejuaniWintersClaw",
            "ExtraSpell3": "SejuaniGlacialPrisonCast",
            "ExtraSpell4": "SejuaniGlacialPrison",
            "ExtraSpell5": "SejuaniBasicAttackW",
            "ExtraSpell6": "SejuaniBasicAttackBoar",
            "GameplayCollisionRadius": 80,
            "HPPerLevel": 95,
            "HPRegenPerLevel": 0.17,
            "IsMelee": true,
            "LevelDodge": 0,
            "Lore1": "Sejuani was weaned on hardship and reared on barbarity. Where others succumbed to the harshness of the Freljord, she was tempered by it until pain became power, hunger an encouragement, and frost an ally in culling the weak. Through her ordeals, she learned that to thrive in the endless winter, one must become just as cold and unforgiving. In Sejuani's eyes, her followers either have the mettle to endure or the right to die. Once she has conquered the Freljord, she knows that those who survive will form a nation to be feared.<br><br>As a child, the leader of the Winter's Claw watched her tribe's numbers slowly dwindle. Cold and starvation took all but the most resilient. She was the only one of her siblings to survive to her tenth year, leaving Sejuani sure that she too would die in misery. In desperation, she sought spiritual counsel from her tribe's mystic. But the seer did not foretell Sejuani's death. Instead, she prophesized that Sejuani would one day conquer and unite the divided tribes of the Freljord.<br><br>Armored with absolute faith in her destiny, Sejuani pushed herself to extremes that would have killed anyone without her will to endure. She walked into blizzards without food or furs and trained while frigid winds raked her flesh. She clashed with the strongest warriors of her tribe, one after another, until her legs gave out beneath her. When she assumed leadership of her tribe, Sejuani commanded her warriors to follow her example. Under her rule, the tribe grew stronger than they had ever been.<br><br>In the end, it was an offer of peace - rather than an act of war - that began Sejuani's campaign of conquest. On the first day of winter, envoys from Ashe's tribe approached Sejuani's camp bearing a gift of Avarosan grain. Ashe's intent was clear: if Sejuani united with her tribe, the Winter's Claw would never go hungry again. To Sejuani, the gift was an insult. In Ashe's tribe, she saw men and women, slight and soft, who preferred to farm instead of fight. Her contempt for them was absolute.<br><br>Sejuani gathered her people and set the grain alight. She proclaimed that Ashe's offer of charity would bring only weakness. Stripping the envoys of their supplies, Sejuani sent them back with a message: the Winter's Claw would prove to the Avarosan that only the strong deserve to survive in the Freljord. As the grain burned behind them, Sejuani rode out with her warband to inflict the first of many painful lessons to come.<br><br>''I was cut from the ice, shaped in the storms, hardened in the cold.''<br>-- Sejuani",
            "MoveSpeed": 340,
            "MPPerLevel": 40,
            "MPRegenPerLevel": 0.09,
            "Name": "Sejuani",
            "Passive1Desc": "Increases all friendly Champions' critical strike chance",
            "Passive1Icon": "Sejuani_Passive.dds",
            "Passive1LuaName": "SejuaniPassive",
            "Passive1Name": "Frost",
            "PassLev1Desc1": "Damaging an enemy with an ability or basic attack grants Sejuani bonus Armor and reduces movement-slowing effects on her.",
            "PassLev1Desc2": "Adds +10% Attack Rate.",
            "PassLev1Desc3": "Adds +15% Attack Rate.",
            "PassLev1Desc4": "Adds +20% Attack Rate.",
            "PathfindingCollisionRadius": 50,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 140,
            "SelectionRadius": 140,
            "Spell1": "SejuaniArcticAssault",
            "Spell2": "SejuaniNorthernWinds",
            "Spell3": "SejuaniWintersClaw",
            "Spell4": "SejuaniGlacialPrisonStart",
            "SpellBlock": 32.1,
            "SpellBlockPerLevel": 1.25,
            "Tips1": "<ul><li>Arctic Assault provides a lot of utility to Sejuani beyond its damage output. Use it to escape bad situations, interupt channeled spells or chase runners.<li>Permafrost has a long range. Saving it until an enemy attempts to escape with a movement ability can allow you to catch back up to them while they're slowed.<li>Save Glacial Prison for encounters where you have teammates present to take advantage of it.</ul>",
            "Tips2": "<ul><li>Dodging Arctic Assault and Glacial Prison can give you a huge advantage. Master using movement abilities or Summoner spells like Flash when Sejuani tries to engage.<li>Stun, slow, or knockback Sejuani when she activates Northern Winds to reduce her ability to deal damage with it.</ul>",
            "UnitTags": "Champion",
            "WeaponMaterial": "SejuaniBasicAttack"
        },
        "DefaultAnimations": {
            "Animation1": "BBs",
            "NumberOfAnimations": 1
        },
        "Info": {
            "IconCircle": "Sejuani_Circle_0.dds",
            "IconSquare": "Sejuani_Square_0.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 6,
            "105898023": 4,
            "11266465": "Destiny",
            "113008000": 8,
            "121269505": 0,
            "129531010": 14,
            "137792515": 16,
            "1639648700": "Teleports Twisted Fate to target distant location.",
            "1662499920": "SejuaniCritAttack2",
            "1662499921": "SejuaniCritAttack3",
            "2500095475": "fighter",
            "2779212989": "Reveals all enemy Champions and slows their movement speed for a short duration.",
            "2786390348": 7,
            "2891533863": 0,
            "3646501220": "Wild Cards",
            "3655487418": "Fires 3 cards in a cone pattern, dealing damage to enemies they hit.",
            "3755028774": 0,
            "386495002": 3,
            "3866412067": "Pick a Card",
            "3983263047": 0,
            "4086322914": "Gate",
            "4094915649": 1054,
            "4146314945": "tank",
            "500084411": "Twisted Fate's attacks can deal extra damage, extra AoE damage with slow, or lots of extra AoE damage with stun!",
            "510504319": 0,
            "767627316": 5
        }
    }
}