{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Tryndamere",
        "Name": "Tryndamere",
        "ResourcePath": "DATA/Characters/Tryndamere/Tryndamere.inibin"
    },
    "Values": {
        "Data": {
            "AcquisitionRange": 400,
            "Armor": 24.108,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3.10000014,
            "AttackDelayCastOffsetPercent": -0.11,
            "AttackDelayOffsetPercent": -0.0672,
            "AttackRange": 125,
            "AttackSpeedPerLevel": 2.9,
            "BaseAttack_Probability": 0.7,
            "BaseCritChance": 0,
            "BaseDamage": 61.376,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 625.64,
            "BaseMP": 100.0,
            "BaseStaticHPRegen": 1.7024,
            "BaseStaticMPRegen": 0,
            "championId": 23,
            "ChasingAttackRangePercent": 0.5,
            "Classification": "Strong",
            "CritAttack": "TryndamereCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": -0.08,
            "CritAttack_AttackDelayOffsetPercent": -0.0672,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3.2,
            "Description": "the Barbarian King",
            "ExtraAttack1": "TryndamereBasicAttack2",
            "ExtraAttack1_Probability": 0.3,
            "ExtraSpell1": "Slash",
            "HPPerLevel": 98,
            "HPRegenPerLevel": 0.18,
            "IsMelee": true,
            "LevelDodge": 0,
            "Lore1": "Fueled by his unbridled fury and rage, Tryndamere cuts his way through the tundra, mastering the art of battle by challenging the Freljord's greatest warriors. The wrathful barbarian seeks revenge on the one who decimated his clan and strikes down all those who stand between him and his final retribution.<br><br>Struggling to survive in the harsh, frostbitten Freljord, the young Tryndamere and his people warred with other tribes over the scarce resources of the land. One such battle changed his life forever. Raiders ambushed Tryndamere's clan in the dead of night, and though his warriors were able to push the first wave of attackers back, they weren't prepared for the dark figure that next stepped forth. He wielded a cruel, living sword, and inspired an unhinged bloodlust in the invaders with his unearthly magic. Tryndamere's tribe was overrun within moments. With no hope of defeating the enigmatic being, Tryndamere threw himself at certain death. The dark figure swatted him aside, mortally wounding the young barbarian.<br><br>Tryndamere saw death and destruction engulf his home as his life slipped away. No one was left standing - only the screams of the dying remained. Unable to surrender to death, Tryndamere gave in fully to his wrath. His blood boiled and his anger consumed him, banishing his mortality. He staggered to his feet - barely able to take hold of his sword - steeling himself for the decisive confrontation with the shadowy being. But the dark figure did not even lift his blade, and instead gave Tryndamere a knowing smile as he withdrew into the shadows. That was the last time the barbarian ever saw his nemesis.<br><br>A man robbed of his home and his people, Tryndamere wandered across the Freljord for years, vowing to forge himself into a brutal instrument of revenge. He visited all the tribes in the frozen wastes, besting each of their warriors until there were none left to challenge. In doing so, he mastered the barbarian ways of war and harnessed his anger as a force to be reckoned with. With sword in hand and rage in his heart, he is now on an undying quest for vengeance against the one who destroyed the life he once knew. <br><br>''Rage is my weapon.''<br> -- Tryndamere",
            "MoveSpeed": 345,
            "MPPerLevel": 0,
            "MPRegenPerLevel": 0,
            "Name": "Tryndamere",
            "PARColor": "255 0 0",
            "PARFadeColor": "175 0 0",
            "PARHasRegenText": 0,
            "PARIncrements": 20,
            "PARMaxSegments": 0,
            "PARNameString": "fury",
            "PARType": "Battlefury",
            "Passive1Icon": "Tryndamere_Passive.dds",
            "Passive1Level1": 1,
            "Passive1Level2": 4,
            "Passive1Level3": 7,
            "Passive1LuaName": "Battle Fury",
            "Passive1Name": "Battle Fury",
            "PassLev1Desc1": "Tryndamere gains Fury for each attack, critical strike, and killing blow he makes. Fury passively increases his Critical Strike Chance and can be consumed with his Bloodlust spell.",
            "PathfindingCollisionRadius": 35,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 180,
            "SelectionRadius": 135,
            "Spell1": "Bloodlust",
            "Spell2": "MockingShout",
            "Spell3": "slashCast",
            "Spell4": "UndyingRage",
            "SpellBlock": 32.1,
            "SpellBlockPerLevel": 1.25,
            "Tips1": "<ul><li>Delaying the activation of Undying Rage is a very effective way to make an enemy champion over-commit to trying to kill you.<li>Bloodlust is an excellent way to heal Tryndamere. Try not to let it fade off before you activate it.<li>If the enemy is stacking Armor, try building items like Last Whisper or Youmuu's Ghostblade.</ul>",
            "Tips2": "<ul><li>Try harassing Tryndamere early so he can't kill minions and heal with Bloodlust.<li>Remember, Tryndamere can only slow you if you are facing away from him.<li>Most of Tryndamere's damage is physical. If he's getting too strong, consider buying a Thornmail.</ul>",
            "UnitTags": "Champion",
            "WeaponMaterial": "TryndamereBasicAttack"
        },
        "HealthBar": {
            "ParallaxOffset": 0,
            "XOffset": 0,
            "YOffset": -0.5
        },
        "Info": {
            "IconCircle": "Tryndamere_Circle.dds",
            "IconSquare": "Tryndamere_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 2,
            "105898023": 5,
            "11266465": "Undying Rage",
            "113008000": 0,
            "121269505": 14,
            "129531010": 0,
            "137792515": 0,
            "1639648700": "Tryndamere slices toward target location, dealing damage to enemies in his path.",
            "2500095475": "assassin",
            "2779212989": "Tryndamere's lust for battle becomes so strong that he is unable to die, no matter how wounded he becomes.",
            "2786390348": 5,
            "3646501220": "Bloodlust",
            "3655487418": "Tryndamere thrives on the thrills of combat.  Whenever Tryndamere kills a unit or critically strikes, he temporarily gains increased damage and critical damage, and he can consume his Bloodlust to restore health.",
            "386495002": 2,
            "3866412067": "Mocking Shout",
            "3983263047": 0,
            "4086322914": "Slash",
            "4094915649": 1054,
            "4146314945": "fighter",
            "500084411": "Tryndamere issues a brave call toward his cowardly enemies.  Enemies deal reduced damage for a few seconds, and enemies turned away from Tryndamere are mocked mercilessly and move slowly like the chicken they are.",
            "510504319": 2,
            "767627316": 10
        }
    }
}