{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Lucian",
        "Name": "Lucian",
        "ResourcePath": "DATA/Characters/Lucian/Lucian.inibin"
    },
    "Values": {
        "Data": {
            "AcquisitionRange": 800,
            "Armor": 24.04,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3,
            "AttackDelayCastOffsetPercent": -0.15,
            "AttackDelayOffsetPercent": -0.02,
            "AttackRange": 500,
            "AttackSpeedPerLevel": 3.3,
            "BaseAttack_Probability": 0,
            "BaseCritChance": 0,
            "BaseDamage": 52.04,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 554.4,
            "BaseMP": 298.88,
            "BaseStaticHPRegen": 1.2384,
            "BaseStaticMPRegen": 1.6352,
            "championId": 236,
            "ChasingAttackRangePercent": 0.900000036,
            "Classification": "Deadly",
            "CritAttack": "LucianCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": -0.15,
            "CritAttack_AttackDelayOffsetPercent": -0.02,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3,
            "Description": "the Purifier",
            "ExtraAttack1": "LucianBasicAttack2",
            "ExtraAttack1_Probability": 1,
            "ExtraAttack2": "LucianPassiveAttack",
            "ExtraCritAttack1": "LucianCritAttack2",
            "ExtraCritAttack1_AttackDelayCastOffsetPercent": -0.15,
            "ExtraCritAttack2": "LucianPassiveAttack",
            "ExtraSpell1": "LucianPassiveShotDummy",
            "ExtraSpell2": "LucianRMissile",
            "ExtraSpell3": "LucianBasicAttack",
            "ExtraSpell4": "LucianBasicAttack2",
            "ExtraSpell5": "LucianCritAttack",
            "ExtraSpell6": "LucianCritAttack2",
            "ExtraSpell7": "LucianPassiveShot",
            "ExtraSpell8": "ItemHurricaneAttack",
            "ExtraSpell9": "LucianWMissile",
            "HPPerLevel": 80,
            "HPRegenPerLevel": 0.13,
            "IsMelee": false,
            "LevelDodge": 0,
            "Lore1": "Lucian wields relic weapons imbued with ancient power and stands a stalwart guardian against the undead. His cold conviction never wavers, even in the face of the maddening horrors he destroys beneath his hail of purifying fire. Lucian walks alone on a grim mission: to purge the spirits of those ensnared in undeath, his eternal beloved among them.<br><br>Like the twin relic weapons they wielded, Lucian and his wife Senna were carved from the same stone. Together they battled evil in Runeterra for years, bringing light to darkness and purging those taken by corruption. They were beacons of righteousness: Senna's dedication to their cause never faltered, while Lucian's kindness and warmth touched the hearts of the many lives they saved. Two parts of one whole, they were devoted and inseparable.<br><br>Though Lucian and Senna witnessed terror that would break most warriors, nothing they had seen compared to the horrors wrought by the Shadow Isles. When the spectral denizens of that accursed place began to manifest across Runeterra, Lucian and Senna hunted them down wherever they appeared. It was grim work, but the fearless pair prevailed until one tragic encounter with the soul-collector Thresh. Lucian and Senna had faced such nightmarish undead before, but never one so deviously clever and cruel. As the terrible battle unfolded, Thresh sprung an unexpected ploy. To Lucian's horror, the creature tricked Senna and ensnared her soul, trapping her in a spectral prison. Nothing could bring her back. Senna was lost, and for the first time, Lucian faced his mission alone. <br><br>Though the Warden had taken half of Lucian's heart, he had also created the Shadow Isles' most dangerous foe. Lucian became a man of dark determination, one who would stop at nothing to purge the undead from the face of Runeterra. In honor of Senna's memory, he took up her fallen weapon and vowed to see their mission through to the end. Now wielding both relic weapons, Lucian fights to slay the undead and cleanse the souls of the Shadow Isles. He knows that Senna's soul is lost, but never loses hope that one day he will bring her peace. <br><br>''Be grateful. By slaying you now, I spare you an eternity of torment.'' <br> -- Lucian",
            "MoveSpeed": 335,
            "MPPerLevel": 41,
            "MPRegenPerLevel": 0.14,
            "Name": "Lucian",
            "Passive1Icon": "Lucian_Passive.dds",
            "Passive1LuaName": "LucianPassive",
            "Passive1Name": "Lightslinger",
            "PassLev1Desc1": "Whenever Lucian uses an ability, his next attack becomes a double-shot.",
            "PathfindingCollisionRadius": 40.68,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 122.2222,
            "SelectionRadius": 100,
            "Spell1": "LucianQ",
            "Spell2": "LucianW",
            "Spell3": "LucianE",
            "Spell4": "LucianR",
            "SpellBlock": 30.0,
            "SpellBlockPerLevel": 0,
            "Tips1": "<ul><li>For optimal burst, try to combine Relentless Pursuit into Piercing Light.<li>Ardent Blaze actually explodes in a star pattern. Try to line it up so the spokes hit enemy champions.<li>Once you have chosen an angle for The Culling, you cannot change it. Pick your moment well!<li>Because of Lightslinger, Lucian benefits more from Attack Damage than he does from Attack Speed.</ul>",
            "Tips2": "<ul><li>Lucian has strong burst, but little sustained damage.<li>Lucian cannot change the aim of The Culling. Take advantage of this by avoiding the angle of the bullets.<li>Piercing Light does not give Lucian extra Attack Range. He still needs to find a target in range to line up his shot. Avoid Piercing Light by anticipating the angle Lucian will choose.</ul>",
            "UnitTags": "Champion"
        },
        "DefaultAnimations": {
            "Animation1": "Buffbones",
            "Animation2": "idle1_BACKUP",
            "NumberOfAnimations": 2
        },
        "HealthBar": {
            "ParallaxOffset": 0,
            "XOffset": 0,
            "YOffset": -0.4
        },
        "IdleParticles": {
            "NumberOfParticles": 2,
            "Particle1": "Lucian_Idle_GunRight.troy buffbone_cstm_Lightgun",
            "Particle2": "Lucian_Idle_GunLeft.troy buffbone_cstm_Darkgun"
        },
        "Info": {
            "IconCircle": "Lucian_Circle.dds",
            "IconSquare": "Lucian_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 3,
            "105898023": 6,
            "11266465": "Buster Shot",
            "113008000": 0,
            "121269505": 0,
            "129531010": 0,
            "137792515": 0,
            "1639648700": "Tristana's attacks will cause slain enemies to explode, dealing area damage",
            "2179197562": true,
            "2441097661": "ATTACKER",
            "2500095475": "",
            "2689327441": false,
            "2779212989": "Tristana loads a massive cannonball into her weapon and fires it at an enemy unit. This deals damage and knocks the target back.",
            "2786390348": 5,
            "2895832853": true,
            "3319269524": true,
            "3646501220": "Rapid Fire",
            "3655487418": "Tristana fires her weapon rapidly, increasing her attack speed for a short time.",
            "3866412067": "Rocket Jump",
            "3972950050": false,
            "4015135009": false,
            "4086322914": "Explosive Shot",
            "4094915649": 1055,
            "4146314945": "marksman",
            "500084411": "Tristana shoots a rocket at the ground, propelling herself toward target location.  She deals area damage and slows on arrival.",
            "504412356": true,
            "510504319": 0,
            "767627316": 8,
            "923756730": true
        }
    }
}