{
    "MetaData": {
        "ContentFormatVersion": 4,
        "Id": "Shaco",
        "Name": "Shaco",
        "ResourcePath": "DATA/Characters/Shaco/Shaco.inibin"
    },
    "Values": {
        "Data": {
            "AcquisitionRange": 400,
            "Armor": 24.88,
            "ArmorMaterial": "Flesh",
            "ArmorPerLevel": 3.5,
            "AttackDelayCastOffsetPercent": -0.078496169,
            "AttackDelayOffsetPercent": -0.1,
            "AttackRange": 125,
            "AttackSpeedPerLevel": 3,
            "BaseAttack_Probability": 0.5,
            "BaseCritChance": 0,
            "BaseDamage": 57.58,
            "BaseDodge": 0,
            "BaseFactorHPRegen": 0,
            "BaseFactorMPRegen": 0,
            "BaseHP": 582.12,
            "BaseMP": 297.2,
            "BaseStaticHPRegen": 1.6748,
            "BaseStaticMPRegen": 1.4312,
            "championId": 35,
            "ChasingAttackRangePercent": 0.5,
            "Classification": "Deadly",
            "CritAttack": "ShacoCritAttack",
            "CritAttack_AttackDelayCastOffsetPercent": -0.078496169,
            "CritAttack_AttackDelayOffsetPercent": -0.1,
            "CritDamageBonus": 2,
            "CritPerLevel": 0,
            "DamagePerLevel": 3.5,
            "Description": "the Demon Jester",
            "ExtraAttack1": "ShacoBasicAttack2",
            "ExtraAttack1_Probability": 0.5,
            "ExtraSpell1": "Hallucinate",
            "HPPerLevel": 84,
            "HPRegenPerLevel": 0.11,
            "IsMelee": true,
            "LevelDodge": 0,
            "Lore1": "Most would say that death isn't funny. It isn't, unless you're Shaco - then it's hysterical. He is Valoran's first fully functioning homicidal comic; he jests until someone dies, and then he laughs. The figure that has come to be known as the Demon Jester is an enigma. No one fully agrees from whence he came, and Shaco never offers any details on his own. A popular belief is that Shaco is not of Runeterra - that he is a thing summoned from a dark and twisted world. Still others believe that he is the demonic manifestation of humanity's dark urges and therefore cannot be reasoned with. The most plausible belief is that Shaco is an assassin for hire, left to his own lunatic devices until his services are needed. Shaco certainly has proven himself to be a cunning individual, evading authorities at every turn who might seek him for questioning for some horrendous, law-breaking atrocity. While such scuttlebutt might reassure the native inhabitants of Valoran, it seems unimaginable that such a malfeasant figure is allowed to remain at large.<br><br>Whatever the truth of his history might be, Shaco has joined the League of Legends for reasons only he knows. He is a terrifying figure, typically shunned by both his fellow champions and the media at large. Only the summoners in the Institute of War know why such a creature was allowed into the League, but most Runeterrans suspect it to be a means that allows the power that be to keep an eye on the ever-elusive Shaco. Unsurprisingly, this champion is popular in places where madness can openly reign, such as among the power-hungry summoners of Zaun and Noxus.<br><br>Whatever you do, don't tell him you missed the punch line.",
            "Lore2": "As time passed, she became the cause of much trouble in Jugo. People became afraid of Annie because of the sudden fires that erupted when the little girl was in a bad mood. Several years later, she threw a temper tantrum over a dropped teddy bear, and completely incinerated her parents and her home. She has since drifted aimlessly from town to town, sometimes becoming angry over a trivial matter at which point great fire storms erupt leaving only a crying orphan girl in their wake. When the darkness inside of her felt the first call of Chaos, it discovered befitting and truly sinister use for the Dark Child.",
            "MoveSpeed": 350,
            "MPPerLevel": 40,
            "MPRegenPerLevel": 0.09,
            "Name": "Shaco",
            "Passive1Desc": "Shaco deals 20% bonus damage when striking a unit from behind.",
            "Passive1Icon": "Jester_CarefulStrikes.dds",
            "Passive1LuaName": "Backstab",
            "Passive1Name": "Backstab",
            "PassLev1Desc1": "Shaco deals 20% bonus damage when striking a unit from behind.",
            "PassLev1Desc2": "+40% Mana Point regeneration.",
            "PassLev1Desc3": "+60% Mana Point regeneration.",
            "PassLev1Desc4": "+80% Mana Point regeneration.",
            "PathfindingCollisionRadius": 35,
            "PlatformEnabled": true,
            "PostAttackMoveDelay": 0,
            "SelectionHeight": 180,
            "SelectionRadius": 135,
            "Spell1": "Deceive",
            "Spell2": "JackInTheBox",
            "Spell3": "TwoShivPoison",
            "Spell4": "HallucinateFull",
            "SpellBlock": 32.1,
            "SpellBlockPerLevel": 1.25,
            "Tips1": "<ul><li>Using Deceive over terrain can help you make a clean escape.<li>Try getting items with on-hit effects. These will also benefit your Hallucination clone.<li>Deceive's damage can be increased with increased Critical Damage effects like Infinity Edge.</ul>",
            "Tips2": "<ul><li>If Shaco is doing well early-game, it is worth the investment to buy Vision Wards.<li>If Shaco uses Deceive to enter a fight he won't be able to quickly use it again to get away. Work with your team to quickly focus him down.</ul>",
            "UnitTags": "Champion",
            "WeaponMaterial": "JesterBasicAttack"
        },
        "Info": {
            "IconCircle": "Jester_Circle.dds",
            "IconSquare": "Jester_Square.dds"
        },
        "UNKNOWN_HASHES": {
            "1040761625": 6,
            "105898023": 9,
            "11266465": "Hallucinate",
            "113008000": 0,
            "121269505": 5,
            "129531010": 14,
            "137792515": 0,
            "1639648700": "Shaco's attacks cause the target to miss and move more slowly.  He can toss his daggers to deal intense damage, and slow and give a miss chance.",
            "2779212989": "Shaco cloaks himself, and continually recloaks himself but drains mana.",
            "2786390348": 4,
            "3646501220": "Jack-In-The-Box",
            "3655487418": "Shaco summons a Jack in the Box at target location, which will damage nearby enemies and wait in hiding for enemies to come near.",
            "3866412067": "Deceive",
            "4086322914": "Two-Shiv Mastery",
            "4094915649": 1055,
            "4146314945": "assassin",
            "500084411": "Shaco creates an illusion of himself nearby, which will explode on death.",
            "510504319": 0,
            "767627316": 8
        }
    }
}